cases/supersonicEjector/hisa_clean/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hisa;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         35000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      4;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat       raw;

runTimeModifiable yes;



functions
{
flowRate{
    #include "flowRatePatch";
        }

flowRateOutlet{
   #include "flowRatePatchOutlet";
	}

flowRateInlet{
   #include "flowRatePatchInlet";
        }

Ma{
   #include "MachNo";
  }
}


// ************************************************************************* //
