cases/supersonicEjector/hisa_clean/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

convertToMeters 0.001;

vertices        ( ( 0 0 0 ) ( 11.5 0 0 ) ( 49.91 0 0 ) ( 57.06 0 0 ) ( 62.1336 0 0 ) ( 64.1319 0 0 ) ( 84.91 0 0 ) ( 143.2 0 0 ) ( 213.736 0 0 ) ( 230.44 0 0 ) ( 330.44 0 0 ) ( 49.91 1.375 0 ) ( 57.06 1.375 0 ) ( 62.1336 2.78204 0 ) ( 62.5 3.26385 0 ) ( 84.91 4.25 0 ) ( 143.2 4.25 0 ) ( 53.625 6.82289 0 ) ( 0 7.425 0 ) ( 11.5 7.425 0 ) ( 66.7186 7.45764 0 ) ( 213.736 7.94661 0 ) ( 63 11.8893 0 ) ( 218 12.4404 0 ) ( 38.8333 12.7546 0 ) ( 27 17.5 0 ) ( 63 17.5 0 ) ( 218 112.44 0 ) ( 0 0 1 ) ( 11.5 0 1 ) ( 49.91 0 1 ) ( 57.06 0 1 ) ( 62.1336 0 1 ) ( 64.1319 0 1 ) ( 84.91 0 1 ) ( 143.2 0 1 ) ( 213.736 0 1 ) ( 230.44 0 1 ) ( 330.44 0 1 ) ( 49.91 1.375 1 ) ( 57.06 1.375 1 ) ( 62.1336 2.78204 1 ) ( 62.5 3.26385 1 ) ( 84.91 4.25 1 ) ( 143.2 4.25 1 ) ( 53.625 6.82289 1 ) ( 0 7.425 1 ) ( 11.5 7.425 1 ) ( 66.7186 7.45764 1 ) ( 213.736 7.94661 1 ) ( 63 11.8893 1 ) ( 218 12.4404 1 ) ( 38.8333 12.7546 1 ) ( 27 17.5 1 ) ( 63 17.5 1 ) ( 218 112.44 1 ) );

edges           ( arc 33 42 ( 63.5869 1.91915 1 ) arc 5 14 ( 63.5869 1.91915 0 ) arc 41 42 ( 62.398 2.96121 1 ) arc 13 14 ( 62.398 2.96121 0 ) arc 49 51 ( 216.947 9.5479 1 ) arc 21 23 ( 216.947 9.5479 0 ) arc 37 51 ( 226.797 8.79672 1 ) arc 9 23 ( 226.797 8.79672 0 ) arc 38 55 ( 297.507 79.5074 1 ) arc 10 27 ( 297.507 79.5074 0 ) arc 48 50 ( 64.0528 8.99673 1 ) arc 20 22 ( 64.0528 8.99673 0 ) );

blocks          ( hex ( 0 1 19 18 28 29 47 46 ) fluid ( 20 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 1 2 11 19 29 30 39 47 ) fluid ( 60 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 2 3 12 11 30 31 40 39 ) fluid ( 20 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 3 4 13 12 31 32 41 40 ) fluid ( 20 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 4 5 14 13 32 33 42 41 ) fluid ( 10 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 5 6 15 14 33 34 43 42 ) fluid ( 60 20 1 ) simpleGrading ( 5 0.2 1 ) hex ( 6 7 16 15 34 35 44 43 ) fluid ( 80 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 7 8 21 16 35 36 49 44 ) fluid ( 80 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 8 9 23 21 36 37 51 49 ) fluid ( 20 20 1 ) simpleGrading ( 1 0.2 1 ) hex ( 9 10 27 23 37 38 55 51 ) fluid ( 40 20 1 ) simpleGrading ( 5 0.2 1 ) hex ( 14 15 20 17 42 43 48 45 ) fluid ( 60 40 1 ) edgeGrading ( 5 1 1 5 5 1 1 5 1 1 1 1 ) hex ( 17 20 22 24 45 48 50 52 ) fluid ( 60 20 1 ) simpleGrading ( 1 1 1 ) hex ( 24 22 26 25 52 50 54 53 ) fluid ( 60 20 1 ) simpleGrading ( 1 1 1 ) );

boundary        ( axis { type empty ; faces ( ( 0 1 29 28 ) ( 1 2 30 29 ) ( 2 3 31 30 ) ( 3 4 32 31 ) ( 4 5 33 32 ) ( 5 6 34 33 ) ( 6 7 35 34 ) ( 7 8 36 35 ) ( 8 9 37 36 ) ( 9 10 38 37 ) ) ; } inletMain { type patch ; faces ( ( 0 28 46 18 ) ) ; } outlet { type patch ; faces ( ( 10 27 55 38 ) ( 27 23 51 55 ) ) ; } inletSecondary { type patch ; faces ( ( 26 25 53 54 ) ) ; } wallNozzle1 { type wall ; faces ( ( 19 18 46 47 ) ( 11 19 47 39 ) ( 12 11 39 40 ) ( 13 12 40 41 ) ( 14 13 41 42 ) ) ; } wallInletSecondary { type wall ; faces ( ( 14 42 45 17 ) ( 17 45 52 24 ) ( 24 52 53 25 ) ( 22 26 54 50 ) ) ; } wallDiffuser { type wall ; faces ( ( 16 15 43 44 ) ( 21 16 44 49 ) ( 23 21 49 51 ) ( 15 20 48 43 ) ( 20 22 50 48 ) ) ; } front { type patch ; faces ( ( 28 29 47 46 ) ( 29 30 39 47 ) ( 30 31 40 39 ) ( 31 32 41 40 ) ( 32 33 42 41 ) ( 33 34 43 42 ) ( 34 35 44 43 ) ( 35 36 49 44 ) ( 36 37 51 49 ) ( 37 38 55 51 ) ( 42 43 48 45 ) ( 45 48 50 52 ) ( 52 50 54 53 ) ) ; } back { type patch ; faces ( ( 0 18 19 1 ) ( 1 19 11 2 ) ( 2 11 12 3 ) ( 3 12 13 4 ) ( 4 13 14 5 ) ( 5 14 15 6 ) ( 6 15 16 7 ) ( 7 16 21 8 ) ( 8 21 23 9 ) ( 9 23 27 10 ) ( 14 17 20 15 ) ( 17 24 22 20 ) ( 24 25 26 22 ) ) ; } );

mergePatchPairs ( );

defaultPatch
{
    type            wall;
    name            walls;
}

scale           0.001;


// ************************************************************************* //
