cases/supersonicEjector/hisa_clean/0.orig/include/freestreamConditions
U             (0 0 0);
p             100000;
T             293;
gamma            1.4;
