cases/supersonicEjector/hisa_clean/0.orig/include/freestreamInletConditions
U             (0 0 0);
p             700000;
T             293;
gamma            1.4;
