cases/supersonicEjector/hisa_clean/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"


    wall
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
    inletMain
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.06;
        value           uniform 0.0;
    }
    inletSecondary
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.06;
        value           uniform 0.0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
